{
  "about": {
    "name": "Timothy Longfield",
    "title": "Welcome to my website!",
    "photo": "https://cdn.glitch.com/8a36501d-26af-4a91-9340-6a95fdd5ab0c%2FPro%20Pic.JPG?v=1612402732561",
    "headline": "Tim Longfield is a junior at Boston College majoring in Computer Science. He grew up in Cambridge, MA with a twin brother and older sister. Tim is an avid Boston sports fan and enjoys playing hockey, baseball, basketball, and tennis.",
    "subheadline": "Although Tim is majoring in Computer Science, he is also interested in data analytics and the emerging field of biomedical engineering/biotechnology."
  },
  "contact": {
    "email": "longfiti@bc.edu",
    "emailRef": "mailto:longfiti@bc.edu",
    "instagram": "timlongfield",
    "instagramRef": "https://www.instagram.com/timlongfield/",
    "linkedin": "LinkedIn",
    "linkedinRef": "https://www.linkedin.com/in/timothy-longfield-1545541a3/"
  },
  "education": {
    "major": "Computer Science B.S.",
    "coursework": "Multivariable Calculus, Linear Algebra, Logic & Computation, Randomness & Computation, Computer Systems, Computer Organization, Algorithms, Database Systems & Applications, Principles of Programming Languages"
  },
  "projects": [
    {
      "id": "iOS",
      "title": "Software Development",
      "icon": "fas fa-laptop-code",
      "description": "Over the last year, Tim developed and iOS app with the mission to revolutionize the way students engage with one another on a college campus. Every day each student receives information from the school and from one another via multiple different platforms. Whether that's an email about a school event, a GroupMe message from your dorm RA, a facebook post about housing, textbooks being sold on instagram, sports news on Twitter, text messages, canvas notifications... the list goes on and on!",
      "subheadline": "Introducing CampusPost -- an exclusive platform for students to share, connect, and exchange on a college campus.",
      "linkTitle": "Learn more about Tim's iOS app!",
      "link": "",
      "projectIntro": "Tim and his brother Matt came up with the idea for CampusPost in January of 2020. Originating as only a marketplace, the app developed into a complex platform for student posts, school events, and direct messaging. Without any previous knowledge of app development or design, Tim read extensively about SwiftUI and explored various resources on the internet. Using Firebase as a backend server, CampusPost is now live at several schools across the Northeast!",
      "projectCaption": "Below is a screenshot of the app's design:",
      "projectLinkText": "View on App Store",
      "projectLink": "https://apps.apple.com/us/app/campuspost/id1530880666",
      "projectImage": "https://cdn.glitch.com/8a36501d-26af-4a91-9340-6a95fdd5ab0c%2FCPost2.png?v=1612463427488"
    },
    {
      "id": "photography",
      "title": "Aerial Drone Photography",
      "icon": "fas fa-helicopter",
      "description": "This summer Tim purchased a DJI Mavic Air 2 drone and recorded clips at his house in Silver Lake, NH.",
      "subheadline": "",
      "linkTitle": "Learn more about Tim's interest in photography!",
      "link": "",
      "projectIntro": "As a kid, Tim loved flying remote control helicopers and taking photos. Over the last few years, drone technology has advanced tremendously, and this summer Tim decided to purchase DJI's Mavic Air 2 drone. With extra time during quarantine and over the summer, Tim recorded clips of boats and scenery around his lake house in New Hampshire. Combining the clips into an iMovie project, he recently published the video to YouTube.",
      "projectCaption": "The photo below was taken in Silver Lake, NH during summer of 2020.",
      "projectLinkText": "Watch on YouTube",
      "projectLink": "https://www.youtube.com/watch?v=OKPeEnyq6Ks&ab_channel=TimLongfield",
      "projectImage": "https://cdn.glitch.com/8a36501d-26af-4a91-9340-6a95fdd5ab0c%2FDrone%20Pic.png?v=1612464422943"
      
    }
  ],
  "news": [
    {
      "title": "BOSTON &rarr; HAWAII",
      "content": "After Tim's spring semester abroad in Spain was canceled due to COVID-19, he and a few of his friends decided to relocate for the spring semester and take advantage of online classes. As someone who is immunocompromised, Tim decided that it would be safer to escape the crowded and reckless BC off-campus neighborhood and find a place in the U.S. where he could avoid the virus and recreate his anticipated adventures abroad. As a result, Tim is currently taking classes in Oahu, Hawaii!"
    }
  ]
}
